Ran Plan for dir: `main/production/instance/ansible-server` workspace: `default`

<details><summary>Show Output</summary>

```diff
time=2024-01-20T06:23:55Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/module/gcp/instances into /root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server/.terragrunt-cache/wV0IMNdlDsw9ssYCGZhA82o7tMk/4PXkA65U96hmj9g2LEGUGOVOWFI
time=2024-01-20T06:23:55Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server] 
time=2024-01-20T06:23:55Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server] 

time=2024-01-20T06:23:55Z level=warning msg=Versioning is not enabled for the remote state GCS bucket production-asofdevlabs. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.10.0"...
- Installing hashicorp/google v5.10.0...
- Installed hashicorp/google v5.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = (known after apply)
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-medium"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt update -y && sudo apt upgrade -y"
      + min_cpu_platform        = (known after apply)
      + name                    = "ansible-server"
      + project                 = "production-410709"
      + self_link               = (known after apply)
      + tags                    = [
          + "http-server",
          + "https-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)
      + zone                    = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-jammy-v20231213a"
              + labels = (known after apply)
              + size   = 10
              + type   = "pd-ssd"
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "default"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip-private-default = [
      + (known after apply),
    ]
  + ip-public-default  = [
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/production/instance/ansible-server/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d main/production/instance/ansible-server`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.234.123/lock?id=ahmadpiee%252Fatlantis-terraform%252Fmain%252Fproduction%252Finstance%252Fansible-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d main/production/instance/ansible-server`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`